GopalSaraf/Practicals/PSDL/include/proc/pic16hv616.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0090h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 0091h
// bitfield definitions
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ANS4_POSN                          equ 0004h
ANSEL_ANS4_POSITION                      equ 0004h
ANSEL_ANS4_SIZE                          equ 0001h
ANSEL_ANS4_LENGTH                        equ 0001h
ANSEL_ANS4_MASK                          equ 0010h
ANSEL_ANS5_POSN                          equ 0005h
ANSEL_ANS5_POSITION                      equ 0005h
ANSEL_ANS5_SIZE                          equ 0001h
ANSEL_ANS5_LENGTH                        equ 0001h
ANSEL_ANS5_MASK                          equ 0020h
ANSEL_ANS6_POSN                          equ 0006h
ANSEL_ANS6_POSITION                      equ 0006h
ANSEL_ANS6_SIZE                          equ 0001h
ANSEL_ANS6_LENGTH                        equ 0001h
ANSEL_ANS6_MASK                          equ 0040h
ANSEL_ANS7_POSN                          equ 0007h
ANSEL_ANS7_POSITION                      equ 0007h
ANSEL_ANS7_SIZE                          equ 0001h
ANSEL_ANS7_LENGTH                        equ 0001h
ANSEL_ANS7_MASK                          equ 0080h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0092h

// Register: WPUA
#define WPUA WPUA
WPUA                                     equ 0095h
// bitfield definitions
WPUA_WPUA0_POSN                          equ 0000h
WPUA_WPUA0_POSITION                      equ 0000h
WPUA_WPUA0_SIZE                          equ 0001h
WPUA_WPUA0_LENGTH                        equ 0001h
WPUA_WPUA0_MASK                          equ 0001h
WPUA_WPUA1_POSN                          equ 0001h
WPUA_WPUA1_POSITION                      equ 0001h
WPUA_WPUA1_SIZE                          equ 0001h
WPUA_WPUA1_LENGTH                        equ 0001h
WPUA_WPUA1_MASK                          equ 0002h
WPUA_WPUA2_POSN                          equ 0002h
WPUA_WPUA2_POSITION                      equ 0002h
WPUA_WPUA2_SIZE                          equ 0001h
WPUA_WPUA2_LENGTH                        equ 0001h
WPUA_WPUA2_MASK                          equ 0004h
WPUA_WPUA4_POSN                          equ 0004h
WPUA_WPUA4_POSITION                      equ 0004h
WPUA_WPUA4_SIZE                          equ 0001h
WPUA_WPUA4_LENGTH                        equ 0001h
WPUA_WPUA4_MASK                          equ 0010h
WPUA_WPUA5_POSN                          equ 0005h
WPUA_WPUA5_POSITION                      equ 0005h
WPUA_WPUA5_SIZE                          equ 0001h
WPUA_WPUA5_LENGTH                        equ 0001h
WPUA_WPUA5_MASK                          equ 0020h
WPUA_WPU0_POSN                           equ 0000h
WPUA_WPU0_POSITION                       equ 0000h
WPUA_WPU0_SIZE                           equ 0001h
WPUA_WPU0_LENGTH                         equ 0001h
WPUA_WPU0_MASK                           equ 0001h
WPUA_WPU1_POSN                           equ 0001h
WPUA_WPU1_POSITION                       equ 0001h
WPUA_WPU1_SIZE                           equ 0001h
WPUA_WPU1_LENGTH                         equ 0001h
WPUA_WPU1_MASK                           equ 0002h
WPUA_WPU2_POSN                           equ 0002h
WPUA_WPU2_POSITION                       equ 0002h
WPUA_WPU2_SIZE                           equ 0001h
WPUA_WPU2_LENGTH                         equ 0001h
WPUA_WPU2_MASK                           equ 0004h
WPUA_WPU4_POSN                           equ 0004h
WPUA_WPU4_POSITION                       equ 0004h
WPUA_WPU4_SIZE                           equ 0001h
WPUA_WPU4_LENGTH                         equ 0001h
WPUA_WPU4_MASK                           equ 0010h
WPUA_WPU5_POSN                           equ 0005h
WPUA_WPU5_POSITION                       equ 0005h
WPUA_WPU5_SIZE                           equ 0001h
WPUA_WPU5_LENGTH                         equ 0001h
WPUA_WPU5_MASK                           equ 0020h

// Register: IOCA
#define IOCA IOCA
IOCA                                     equ 0096h
// bitfield definitions
IOCA_IOCA0_POSN                          equ 0000h
IOCA_IOCA0_POSITION                      equ 0000h
IOCA_IOCA0_SIZE                          equ 0001h
IOCA_IOCA0_LENGTH                        equ 0001h
IOCA_IOCA0_MASK                          equ 0001h
IOCA_IOCA1_POSN                          equ 0001h
IOCA_IOCA1_POSITION                      equ 0001h
IOCA_IOCA1_SIZE                          equ 0001h
IOCA_IOCA1_LENGTH                        equ 0001h
IOCA_IOCA1_MASK                          equ 0002h
IOCA_IOCA2_POSN                          equ 0002h
IOCA_IOCA2_POSITION                      equ 0002h
IOCA_IOCA2_SIZE                          equ 0001h
IOCA_IOCA2_LENGTH                        equ 0001h
IOCA_IOCA2_MASK                          equ 0004h
IOCA_IOCA3_POSN                          equ 0003h
IOCA_IOCA3_POSITION                      equ 0003h
IOCA_IOCA3_SIZE                          equ 0001h
IOCA_IOCA3_LENGTH                        equ 0001h
IOCA_IOCA3_MASK                          equ 0008h
IOCA_IOCA4_POSN                          equ 0004h
IOCA_IOCA4_POSITION                      equ 0004h
IOCA_IOCA4_SIZE                          equ 0001h
IOCA_IOCA4_LENGTH                        equ 0001h
IOCA_IOCA4_MASK                          equ 0010h
IOCA_IOCA5_POSN                          equ 0005h
IOCA_IOCA5_POSITION                      equ 0005h
IOCA_IOCA5_SIZE                          equ 0001h
IOCA_IOCA5_LENGTH                        equ 0001h
IOCA_IOCA5_MASK                          equ 0020h
IOCA_IOC0_POSN                           equ 0000h
IOCA_IOC0_POSITION                       equ 0000h
IOCA_IOC0_SIZE                           equ 0001h
IOCA_IOC0_LENGTH                         equ 0001h
IOCA_IOC0_MASK                           equ 0001h
IOCA_IOC1_POSN                           equ 0001h
IOCA_IOC1_POSITION                       equ 0001h
IOCA_IOC1_SIZE                           equ 0001h
IOCA_IOC1_LENGTH                         equ 0001h
IOCA_IOC1_MASK                           equ 0002h
IOCA_IOC2_POSN                           equ 0002h
IOCA_IOC2_POSITION                       equ 0002h
IOCA_IOC2_SIZE                           equ 0001h
IOCA_IOC2_LENGTH                         equ 0001h
IOCA_IOC2_MASK                           equ 0004h
IOCA_IOC3_POSN                           equ 0003h
IOCA_IOC3_POSITION                       equ 0003h
IOCA_IOC3_SIZE                           equ 0001h
IOCA_IOC3_LENGTH                         equ 0001h
IOCA_IOC3_MASK                           equ 0008h
IOCA_IOC4_POSN                           equ 0004h
IOCA_IOC4_POSITION                       equ 0004h
IOCA_IOC4_SIZE                           equ 0001h
IOCA_IOC4_LENGTH                         equ 0001h
IOCA_IOC4_MASK                           equ 0010h
IOCA_IOC5_POSN                           equ 0005h
IOCA_IOC5_POSITION                       equ 0005h
IOCA_IOC5_SIZE                           equ 0001h
IOCA_IOC5_LENGTH                         equ 0001h
IOCA_IOC5_MASK                           equ 0020h

// Register: SRCON0
#define SRCON0 SRCON0
SRCON0                                   equ 0099h
// bitfield definitions
SRCON0_SRCLKEN_POSN                      equ 0000h
SRCON0_SRCLKEN_POSITION                  equ 0000h
SRCON0_SRCLKEN_SIZE                      equ 0001h
SRCON0_SRCLKEN_LENGTH                    equ 0001h
SRCON0_SRCLKEN_MASK                      equ 0001h
SRCON0_PULSR_POSN                        equ 0002h
SRCON0_PULSR_POSITION                    equ 0002h
SRCON0_PULSR_SIZE                        equ 0001h
SRCON0_PULSR_LENGTH                      equ 0001h
SRCON0_PULSR_MASK                        equ 0004h
SRCON0_PULSS_POSN                        equ 0003h
SRCON0_PULSS_POSITION                    equ 0003h
SRCON0_PULSS_SIZE                        equ 0001h
SRCON0_PULSS_LENGTH                      equ 0001h
SRCON0_PULSS_MASK                        equ 0008h
SRCON0_C2REN_POSN                        equ 0004h
SRCON0_C2REN_POSITION                    equ 0004h
SRCON0_C2REN_SIZE                        equ 0001h
SRCON0_C2REN_LENGTH                      equ 0001h
SRCON0_C2REN_MASK                        equ 0010h
SRCON0_C1SEN_POSN                        equ 0005h
SRCON0_C1SEN_POSITION                    equ 0005h
SRCON0_C1SEN_SIZE                        equ 0001h
SRCON0_C1SEN_LENGTH                      equ 0001h
SRCON0_C1SEN_MASK                        equ 0020h
SRCON0_SR_POSN                           equ 0006h
SRCON0_SR_POSITION                       equ 0006h
SRCON0_SR_SIZE                           equ 0002h
SRCON0_SR_LENGTH                         equ 0002h
SRCON0_SR_MASK                           equ 00C0h
SRCON0_SR0_POSN                          equ 0006h
SRCON0_SR0_POSITION                      equ 0006h
SRCON0_SR0_SIZE                          equ 0001h
SRCON0_SR0_LENGTH                        equ 0001h
SRCON0_SR0_MASK                          equ 0040h
SRCON0_SR1_POSN                          equ 0007h
SRCON0_SR1_POSITION                      equ 0007h
SRCON0_SR1_SIZE                          equ 0001h
SRCON0_SR1_LENGTH                        equ 0001h
SRCON0_SR1_MASK                          equ 0080h

// Register: SRCON1
#define SRCON1 SRCON1
SRCON1                                   equ 009Ah
// bitfield definitions
SRCON1_SRCS_POSN                         equ 0006h
SRCON1_SRCS_POSITION                     equ 0006h
SRCON1_SRCS_SIZE                         equ 0002h
SRCON1_SRCS_LENGTH                       equ 0002h
SRCON1_SRCS_MASK                         equ 00C0h
SRCON1_SRCS0_POSN                        equ 0006h
SRCON1_SRCS0_POSITION                    equ 0006h
SRCON1_SRCS0_SIZE                        equ 0001h
SRCON1_SRCS0_LENGTH                      equ 0001h
SRCON1_SRCS0_MASK                        equ 0040h
SRCON1_SRCS1_POSN                        equ 0007h
SRCON1_SRCS1_POSITION                    equ 0007h
SRCON1_SRCS1_SIZE                        equ 0001h
SRCON1_SRCS1_LENGTH                      equ 0001h
SRCON1_SRCS1_MASK                        equ 0080h

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Eh

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Fh
// bitfield definitions
ADCON1_ADCS_POSN                         equ 0004h
ADCON1_ADCS_POSITION                     equ 0004h
ADCON1_ADCS_SIZE                         equ 0003h
ADCON1_ADCS_LENGTH                       equ 0003h
ADCON1_ADCS_MASK                         equ 0070h
ADCON1_ADCS0_POSN                        equ 0004h
ADCON1_ADCS0_POSITION                    equ 0004h
ADCON1_ADCS0_SIZE                        equ 0001h
ADCON1_ADCS0_LENGTH                      equ 0001h
ADCON1_ADCS0_MASK                        equ 0010h
ADCON1_ADCS1_POSN                        equ 0005h
ADCON1_ADCS1_POSITION                    equ 0005h
ADCON1_ADCS1_SIZE                        equ 0001h
ADCON1_ADCS1_LENGTH                      equ 0001h
ADCON1_ADCS1_MASK                        equ 0020h
ADCON1_ADCS2_POSN                        equ 0006h
ADCON1_ADCS2_POSITION                    equ 0006h
ADCON1_ADCS2_SIZE                        equ 0001h
ADCON1_ADCS2_LENGTH                      equ 0001h
ADCON1_ADCS2_MASK                        equ 0040h

